{
    "ginny-test": {
        "user_query": "\nGive me a 5 day chill trip plan to Sydney, my budget is $3000 CAD.\n",
        "selected_trip": "\n**Destination:** Sydney, Australia\n\n**Duration:** 5 days, 4 nights\n\n**Points of Interest:** 13\n\n**Budget**: CA$3263\n\n### Day 01: Arrival in Sydney\n\n- **Flight:** From home city to Sydney.\n- **Breakfast:** Not included (recommendation for local meals).\n- **Transportation:** Airport transfer (1 hour).\n- **Dinner:** Not included (recommendation for local meals).\n- **Hotel:** Stanford Plaza Sydney Airport or Pullman Sydney Airport.\n\n### Day 02: Sydney Sightseeing\n\n- **Breakfast:** Hotel breakfast (30 CNY per person).\n- **Transportation:** Private transfer.\n- **Activities:** Visit Sydney University, Sydney Harbour Bridge, Sydney Opera House, Royal Botanic Gardens, and Queen Victoria Building. (Total 5 POIs)\n- **Dinner:** Not included (recommendation for local meals).\n- **Hotel:** Same as Day 01.\n\n### Day 03: Markets, Parks, and Beaches\n\n- **Breakfast:** Hotel breakfast.\n- **Transportation:** Private transfer.\n- **Activities:** Visit Sydney Fish Market, Hyde Park, Taronga Zoo, and Bondi Beach. (Total 4 POIs)\n- **Dinner:** Not included (recommendation for local meals).\n- **Hotel:** Same as Day 01.\n\n### Day 04: Blue Mountains National Park\n\n- **Breakfast:** Hotel breakfast.\n- **Transportation:** Private transfer.\n- **Activities:** Explore Blue Mountains National Park, Three Sisters, and Leura Main Street. (Total 3 POIs)\n- **Dinner:** Not included (recommendation for local meals).\n- **Hotel:** Same as Day 01.\n\n### Day 05: Departure\n\n- **Breakfast:** Hotel breakfast.\n- **Transportation:** Transfer to the airport for flight back to home city.\n- **Lunch & Dinner:** Not included.\n- **Flight:** Based on flight time.\n"
    },
    "refinement-initial-trip-plan-example": {
        "user_query": "\nI would like to go to Iceland for a short road trip. I really like a short duration trips that should be above 3 days. I don’t have too much budget. It should be below $500 USD. In terms of the itineraries, arrange it as much as possible. Hopefully the trip can be intense, low-cost, and a enjoyable short trip.\n",
        "selected_trip": "3-Day Budget-Friendly Iceland Adventure\n\nDay 1: Arrival and Reykjavík Exploration\n\nMorning/Afternoon: Arrive at Keflavík International Airport and transfer to budget accommodation in Reykjavík (hostel or guesthouse recommended for cost savings).\nEvening: Explore downtown Reykjavík. Key spots include Hallgrímskirkja Church and the Sun Voyager sculpture. Enjoy an affordable meal at a local café or try the popular Bæjarins Beztu Pylsur hot dog stand.\n\nDay 2: Golden Circle Highlights\n\nMorning: Join a budget-friendly bus tour of the Golden Circle. Key stops include:\n- Þingvellir National Park: Walk between tectonic plates (North American and Eurasian).\n- Geysir Geothermal Area: Watch Strokkur geyser erupt every few minutes.\n- Gullfoss Waterfall: One of Iceland's most iconic waterfalls.\nAfternoon: Return to Reykjavík and explore local museums or relax at a geothermal pool, like Laugardalslaug.\nEvening: Join a budget Northern Lights bus tour (if conditions allow).\n\nDay 3: South Coast Adventure\n\nMorning: Take a day tour of Iceland's south coast. Stops include:\n- Seljalandsfoss Waterfall: Unique waterfall where you can walk behind the cascade.\n- Skógafoss Waterfall: 60-meter tall, one of Iceland’s most majestic.\n- Reynisfjara Black Sand Beach: Known for its black sands and basalt formations.\nAfternoon: Continue exploring with an optional glacier hike at Sólheimajökull (additional cost).\nEvening: Return to Reykjavík and enjoy one last night with local dining or live music.\n\nAdditional Tips:\n- Accommodation: Opt for budget-friendly hostels, guesthouses, or Airbnb.\n- Meals: Use Reykjavík’s affordable eateries, bakeries, or supermarkets. Prepare some meals if possible.\n- Transportation: Walk or use public transportation; most city attractions are easily accessible.\n- Tours: Book in advance for best prices, seek package deals.\n\nTrip Plan Analysis:\n- Budget: CA$750 (estimated based on budget accommodation, meals, and tours)\n- Destination: Reykjavík, Iceland\n- Density of Points of Interest: 6 major highlights (Golden Circle sites, Reykjavík attractions, South Coast stops)\n- Duration: 3 days",
    }
}